jmeter/tests/script-race-lab.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Script Race Lab Load Test" enabled="true">
      <stringProp name="TestPlan.comments">script-race-lab parent: 30 concurrent starts so N subflow output-mapping compilations land in one emit window. Fails a sample when the instance ends Faulted.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="base.url" elementType="Argument">
            <stringProp name="Argument.name">base.url</stringProp>
            <stringProp name="Argument.value">${__P(base.url,http://host.docker.internal:4201)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="users" elementType="Argument">
            <stringProp name="Argument.name">users</stringProp>
            <stringProp name="Argument.value">${__P(users,30)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rampup" elementType="Argument">
            <stringProp name="Argument.name">rampup</stringProp>
            <stringProp name="Argument.value">${__P(rampup,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="loops" elementType="Argument">
            <stringProp name="Argument.name">loops</stringProp>
            <stringProp name="Argument.value">${__P(loops,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Race Starters" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${loops}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${users}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampup}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- Per-iteration setup: random key + request id -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Setup Random Vars" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.util.UUID
def rnd = new Random()
def sb = new StringBuilder()
17.times { sb.append(rnd.nextInt(10)) }
vars.put("key", sb.toString())
vars.put("requestId", UUID.randomUUID().toString())
vars.put("status", "")
vars.put("pollCount", "0")

def baseUrl = vars.get("base.url") ?: props.get("base.url") ?: "http://host.docker.internal:4201"
def u = new java.net.URL(baseUrl)
vars.put("protocol", u.getProtocol())
vars.put("host", u.getHost())
vars.put("port", (u.getPort() == -1 ? (u.getProtocol() == "https" ? "443" : "80") : u.getPort()).toString())
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <!-- 1) START INSTANCE -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="1. Start Instance" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"testId":"jm-${__threadNum}-${requestId}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/core/workflows/script-race-lab-parent/instances/start?sync=false</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Start Headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">Accept-Language</stringProp><stringProp name="Header.value">tr-TR</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">X-Request-Id</stringProp><stringProp name="Header.value">${requestId}</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">X-Device-Id</stringProp><stringProp name="Header.value">${requestId}</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">X-Token-Id</stringProp><stringProp name="Header.value">${requestId}</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">X-Device-Info</stringProp><stringProp name="Header.value">IOS 16</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">X-Forwarded-For</stringProp><stringProp name="Header.value">192.168.2.1</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">user_reference</stringProp><stringProp name="Header.value">34987491018</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">sub</stringProp><stringProp name="Header.value">34987491018</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">act_sub</stringProp><stringProp name="Header.value">34987491780</stringProp></elementProp>
              <elementProp name="" elementType="Header"><stringProp name="Header.name">role</stringProp><stringProp name="Header.value">morph-idm.viewers</stringProp></elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract instanceId" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">instanceId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- POLL 1: wait for a terminal status (C or F) -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Poll 1 - Reset Counter" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">vars.put("pollCount","0"); vars.put("status","");</stringProp>
          <stringProp name="cacheKey">true</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="While status != C &amp;&amp; status != F &amp;&amp; pollCount &lt; 60" enabled="true">
          <stringProp name="WhileController.condition">${__groovy(!"C".equals(vars.get("status")) &amp;&amp; !"F".equals(vars.get("status")) &amp;&amp; (vars.get("pollCount") as Integer) &lt; 60)}</stringProp>
        </WhileController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET state" enabled="true">
            <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
            <stringProp name="HTTPSampler.domain">${host}</stringProp>
            <stringProp name="HTTPSampler.port">${port}</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/core/workflows/script-race-lab-parent/instances/${instanceId}/functions/state</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="State Headers" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header"><stringProp name="Header.name">sub</stringProp><stringProp name="Header.value">349874917801</stringProp></elementProp>
                <elementProp name="" elementType="Header"><stringProp name="Header.name">act_sub</stringProp><stringProp name="Header.value">34987491781</stringProp></elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract status" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">status</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.status</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Inc Counter + Backoff if B" enabled="true">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script">def c = (vars.get("pollCount") as Integer) + 1
vars.put("pollCount", c.toString())
def s = vars.get("status")
if ("B".equals(s)) { Thread.sleep(1000) }
if ("F".equals(s) || "C".equals(s)) { ctx.setRestartNextLoop(true) }
</stringProp>
              <stringProp name="cacheKey">true</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Not Faulted" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="faulted">"status":"F"</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">6</intProp>
              <stringProp name="Assertion.custom_message">instance FAULTED — expected Instance:100030 / 'Assembly with same name is already loaded' in the runtime log</stringProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <!-- Listeners -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>